#include <stdio.h>

int main() {
	////증감 연산자
	////1 증가 or 감소
	//int a = 0;
	//a++; //1
	//a++; //2
	//printf("a:%d\n", a++); //2

	//int b = 0;
	//++b; //1
	//++b; //2
	//printf("b:%d\n", ++b); //3 먼저 ++쓴거

	////삼항 연산자 은근 중요
	//int a;
	//// 조건 ? 값1 : 값2;
	//int a = 3 > 1 ? 100 : 200; // 참이면 왼쪽값, 거짓이면 오른쪽 값 // 100
	//int b = 3 < 1 ? 100 : 200;
	//printf("a: %d,b:%d\n", a, b);

	//int c, d;

	//printf("두 수를 입력하세요");
	//scanf_s("%d %d", &c, &d);
	//printf("큰 수는 %d입니다", c > d ? c : d);

	/*문제 1
	int t;
	printf("0부터 99999 사이의 정수를 입력하세요");
	scanf_s("%d", &t);
	printf("%d만 %d천 %백 %d십 %d\n", t / 10000, t % 10000/1000, t % 10000 %1000/100, t % 10000 % 1000 % 100/10, t % 10000 % 1000 % 100 % 10);*/

	//문제2 
	// int a;
	//printf("양의 정수를 입력하세요");
	//scanf_s("%d", &a);
	//int h = a / 3600;
	//int m = a % 3600 / 60;
	//int s = a % 3600 % 60;

	//printf("%d시간 %d분 %d초",h, m,s);

	////문제3
	//int r;
	//printf("10000부터 99999 사이의 양의 정수를 입력하세요");
	//scanf_s("%d", &r);
	//printf("%d", r % 10000 % 1000 / 100);

	//문제4
	int j;
	printf("정수를 입력하세요");
	scanf_s("%d", &j);
	printf("%d", (20 < j < 30) ? 1 : 0);



	return 0;
}